velumanohar2000/TM4C-RTOS/kernel.c
// Kernel functions
// J Losh

//-----------------------------------------------------------------------------
// Hardware Target
//-----------------------------------------------------------------------------

// Target uC:       TM4C123GH6PM
// System Clock:    40 MHz

//-----------------------------------------------------------------------------
// Device includes, defines, and assembler directives
//-----------------------------------------------------------------------------

#include <stdint.h>
#include "tm4c123gh6pm.h"
#include "mm.h"
#include "kernel.h"
#include "uart0.h"
#include "asm.h"


//-----------------------------------------------------------------------------
// RTOS Defines and Kernel Variables
//-----------------------------------------------------------------------------

// mutex
typedef struct _mutex
{
    char name[64];
    bool lock;
    uint8_t queueSize;      // 0 = nobody in queue
    uint8_t processQueue[MAX_MUTEX_QUEUE_SIZE];
    uint8_t lockedBy;    //can only be unlocked by task that locked it
} mutex;
mutex mutexes[MAX_MUTEXES];

// semaphore
typedef struct _semaphore
{
    char name[64];
    uint8_t count;
    uint8_t queueSize;
    uint8_t processQueue[MAX_SEMAPHORE_QUEUE_SIZE];
} semaphore;
semaphore semaphores[MAX_SEMAPHORES];

// task states
#define STATE_INVALID           0 // no task
#define STATE_STOPPED           1 // stopped, can be resumed
#define STATE_UNRUN             2 // task has never been run
#define STATE_READY             3 // has run, can resume at any time
#define STATE_DELAYED           4 // has run, but now awaiting timer
#define STATE_BLOCKED_MUTEX     5 // has run, but now blocked by mutex
#define STATE_BLOCKED_SEMAPHORE 6 // has run, but now blocked by semaphore


// Kernel Calls
#define YIELD                   1  // When called switches task
#define SLEEP                   2  // When called puts task to sleep
#define MUTEX_LOCK              3  // When called locks resource or adds to resource queue
#define MUTEX_UNLOCK            4  // When called unlocks resource
#define SEMAPHORE_WAIT          5  // When called uses resource if available or adds to resource queue
#define SEMAPHORE_POST          6  // When called returns resource
#define SCHEDULER_TYPE          7  // When called will either switch to Round Robin or Priority scheduler
#define GET_PID                 8  // When called will get of process name
#define GET_MUTEX_INFO          9  // When called will get mutex info name
#define GET_SEMAPHORE_INFO      10 // When called will get semaphore info
#define STOP_THREAD             11 // When called will stop thread and unblock mutexes and remove from wait of semaphores
#define RESTART_THREAD          12 // When called will restart thread
#define PREEMPTION_TOGGLE       13 // When called will toggle Preemption on or off
#define THREAD_PRIORITY         14 // When called will set priority of thread
#define REBOOT                  15 // When called will reboot hardware
#define GET_TASK_INFO           16 // When called will get task info
// task
uint8_t taskCurrent = 0;          // index of last dispatched task
uint8_t taskCount = 0;            // total number of valid tasks
uint8_t lastTaskRun[8] = {0};
uint32_t timeCurrent = 0;

// control
bool priorityScheduler = true;    // priority (true) or round-robin (false)
bool priorityInheritance = false; // priority inheritance for mutexes
bool preemption = false;          // preemption (true) or cooperative (false)

//For CPU time
bool ping = true;                   // Ping means to write in clock[0]
uint16_t secondCounter = 0;

// tcb
#define NUM_PRIORITIES   8
struct _tcb
{
    uint8_t state;                  // see STATE_ values above
    void *pid;                      // used to uniquely identify thread (add of task fn)
    void *spInit;                   // original top of stack
    void *sp;                       // current stack pointer
    uint8_t priority;               // 0=highest
    uint8_t currentPriority;        // 0=highest (needed for pi)
    uint32_t ticks;                 // ticks until sleep complete
    uint8_t srd[NUM_SRAM_REGIONS];  // MPU subregion disable bits
    char name[16];                  // name of task used in ps command
    int8_t mutex;                   // index of the mutex in use or blocking the thread
    int8_t semaphore;               // index of the semaphore that is blocking the thread
    uint32_t clocks[2];
} tcb[MAX_TASKS];

//-----------------------------------------------------------------------------
// Subroutines
//-----------------------------------------------------------------------------

bool initMutex(uint8_t mutex, const char name[])
{
    bool ok = (mutex < MAX_MUTEXES);
    if (ok)
    {
        stringCopy(mutexes[mutex].name, name);
        mutexes[mutex].lock = false;
        mutexes[mutex].lockedBy = 0;
    }
    return ok;
}

bool initSemaphore(uint8_t semaphore, uint8_t count, const char name[])
{
    bool ok = (semaphore < MAX_SEMAPHORES);
    {
        stringCopy(semaphores[semaphore].name, name);
        semaphores[semaphore].count = count;
    }
    return ok;
}

// REQUIRED: initialize systick for 1ms system timer
void initRtos(void)
{
    uint8_t i;
    // no tasks running
    taskCount = 0;
    // clear out tcb records
    for (i = 0; i < MAX_TASKS; i++)
    {
        tcb[i].state = STATE_INVALID;
        tcb[i].pid = 0;
        tcb[i].mutex = -1;
        tcb[i].semaphore = -1;
        tcb[i].clocks[0] = 0;
        tcb[i].clocks[1] = 0;
    }
}

// REQUIRED: Implement prioritization to NUM_PRIORITIES
uint8_t rtosScheduler(void)
{
    bool ok;
    static uint8_t task = 0xFF;
    ok = false;
    uint8_t i = 0;
    if (priorityScheduler)
    {
        uint8_t highestPriorityLevel = 0xFF;
        uint8_t checkTask;
        //find highest priority level (lowest number)
        for (i = 0; i < MAX_TASKS; i++)
        {
            if (tcb[i].priority < highestPriorityLevel && (tcb[i].state == STATE_READY || tcb[i].state == STATE_UNRUN))
            {
                highestPriorityLevel = tcb[i].priority;
            }
            if (highestPriorityLevel == 0)
                break;
        }

        //Round Robin in the highest priority found
        checkTask = lastTaskRun[highestPriorityLevel];
        while(!ok)
        {
            checkTask++;
            if (checkTask >= MAX_TASKS)
                checkTask = 0;

