velumanohar2000/TM4C-RTOS/kernel.c
            if (tcb[checkTask].priority == highestPriorityLevel && (tcb[checkTask].state == STATE_READY || tcb[checkTask].state == STATE_UNRUN))
            {
                lastTaskRun[highestPriorityLevel] = checkTask;
                ok = true;
            }
        }
        return checkTask;


    }
    else //ROUND ROBIN Scheduler
    {
        while (!ok)
        {
            task++;
            if (task >= MAX_TASKS)
                task = 0;
            ok = (tcb[task].state == STATE_READY || tcb[task].state == STATE_UNRUN);
        }
        return task;
    }

}

// REQUIRED: modify this function to start the operating system
// by calling scheduler, set srd bits, setting PSP, ASP bit, TMPL bit, and PC
void startRtos(void)
{
    taskCurrent = rtosScheduler();
    tcb[taskCurrent].state = STATE_READY;


    setSramAccessWindow(tcb[taskCurrent].srd);
    setPSP((uint32_t)tcb[taskCurrent].spInit);
    setControlRegister(2);

    _fn fn = (_fn)tcb[taskCurrent].pid;

    setControlRegister(3);
    WTIMER1_CTL_R |= TIMER_CTL_TAEN;                 // turn-on counter
    fn();
}

// REQUIRED:
// add task if room in task list
// store the thread name
// allocate stack space and store top of stack in sp and spInit
// set the srd bits based on the memory allocation
bool createThread(_fn fn, const char name[], uint8_t priority, uint32_t stackBytes)
{
    bool ok = false;
    uint8_t i = 0;
    uint8_t j;
    bool found = false;
    if (taskCount < MAX_TASKS)
    {
        // make sure fn not already in list (prevent re-entrancy)
        while (!found && (i < MAX_TASKS))
        {
            found = (tcb[i++].pid ==  fn);
        }
        if (!found)
        {
            // find first available tcb record
            i = 0;
            while (tcb[i].state != STATE_INVALID) {i++;}
            tcb[i].state = STATE_UNRUN;
            tcb[i].pid = fn;           //set pid to function address

            // allocate stack space and store top of stack in sp and spInit
            // set the srd bits based on the memory allocation
            for (j = 0; j < NUM_SRAM_REGIONS; j++)
                tcb[i].srd[j] = 0;

            uint32_t *ptr1 = mallocFromHeap(stackBytes, tcb[i].srd);
            tcb[i].sp = (uint32_t*)((uint32_t)ptr1 + stackBytes-1);
            tcb[i].spInit = (uint32_t*)((uint32_t)ptr1 + stackBytes-1);

            j = 0;
            stringCopy(tcb[i].name, name);

            tcb[i].priority = priority;
            // increment task count
            taskCount++;
            ok = true;
        }
    }
    return ok;
}


// REQUIRED: modify this function to yield execution back to scheduler using pendsv
void yield(void)
{
    __asm("   SVC #1");
}

// REQUIRED: modify this function to support 1ms system timer
// execution yielded back to scheduler until time elapses using pendsv
void sleep(uint32_t tick)
{
    __asm("   SVC #2");
}

// REQUIRED: modify this function to lock a mutex using pendsv
void lock(int8_t mutex)
{
    __asm("   SVC #3");
}

// REQUIRED: modify this function to unlock a mutex using pendsv
void unlock(int8_t mutex)
{
    __asm("   SVC #4");
}

// REQUIRED: modify this function to wait a semaphore using pendsv
void wait(int8_t semaphore)
{
    __asm("   SVC #5");
}

// REQUIRED: modify this function to signal a semaphore is available using pendsv
void post(int8_t semaphore)
{
    __asm("   SVC #6");
}

void schedSelect(bool sched)
{
    __asm("   SVC #7");
}
int getPid(const char processName[])
{
    __asm("   SVC #8");
}

void getMutexInfo(MUTEX_INFO *mutexInfo, uint8_t mutexNumber)
{
    __asm("   SVC #9");
}
void getSemaphoreInfo(SEM_INFO *semaphoreInfo, uint8_t semNumber)
{
    __asm("   SVC #10");
}
// REQUIRED: modify this function to stop a thread
// REQUIRED: remove any pending semaphore waiting, unlock any mutexes
void stopThread(_fn fn)
{
    __asm("   SVC #11");
}
// REQUIRED: modify this function to restart a thread
void restartThread(_fn fn)
{
    __asm("   SVC #12");
}
void togglePreemption(bool preempt)
{
    __asm("   SVC #13");
}
// REQUIRED: modify this function to set a thread priority
void setThreadPriority(_fn fn, uint8_t priority)
{
    __asm("   SVC #14");
}

void rebootSystem()
{
    __asm("   SVC #15");
}

void getTaskInfo(TASK_INFO *taskInfo, uint8_t taskNum)
{
    __asm("   SVC #16");

}

void initSysTickIsr()
{
    //FIXME: Need to check if load value is correct
    NVIC_ST_RELOAD_R = 40000-1;     //40 clocks per microsecond == 40000 clocks per millisecond
    NVIC_ST_CURRENT_R = 0;
    NVIC_ST_CTRL_R = 0x7;  // Use system clock, Enable interrupt, enable SysTick
}
uint32_t getPID()
{
    return (uint32_t)tcb[taskCurrent].pid;
}
// REQUIRED: modify this function to add support for the system timer
// REQUIRED: in preemptive code, add code to request task switch
void systickIsr(void)
{
    uint8_t i = 0;
    for (i = 0; i < taskCount; i++)
    {
        if (tcb[i].state == STATE_DELAYED)
        {
            tcb[i].ticks -=1;
            if (tcb[i].ticks == 0)
            {
                tcb[i].state = STATE_READY;
            }
        }
    }

    secondCounter++;
    if (secondCounter == 3000)
    {
        ping = !ping;

        if (ping)
            for (i = 0; i < taskCount; i++)
                tcb[i].clocks[1] = 0;
        else
            for (i = 0; i < taskCount; i++)
                tcb[i].clocks[0] = 0;

        secondCounter = 0;

        WTIMER1_TAV_R = 0;
    }



    if (preemption)
        NVIC_INT_CTRL_R |= NVIC_INT_CTRL_PEND_SV;



}

void initWideTimer()
{
    SYSCTL_RCGCWTIMER_R |= SYSCTL_RCGCWTIMER_R1;     // enable timer clocks
    _delay_cycles(3);

    WTIMER1_CTL_R &= ~TIMER_CTL_TAEN;                // turn-off counter before reconfiguring
    WTIMER1_CFG_R = 4;                               // configure as 64-bit counter (A+B only)

    WTIMER1_TAMR_R = TIMER_TAMR_TAMR_1_SHOT | TIMER_TAMR_TACDIR; // configure for one shot, count up
    WTIMER1_TAV_R = 0;                               // zero counter for first period
}


