velumanohar2000/TM4C-RTOS/kernel.c
// REQUIRED: in coop and preemptive, modify this function to add support for task switching
// REQUIRED: process UNRUN and READY tasks differently

void stopThreadHelper(uint32_t pid)
{
    uint8_t i = 0;
    bool found = false;
    for (i = 0; i < taskCount; i++)
    {
        if ((uint32_t)tcb[i].pid == pid)
        {
            found = true;
            break;
        }
    }
    if (found)
    {
        uint8_t taskTokill = i;
        putsUart0("Killed ");
        putsUart0(tcb[taskTokill].name);
        putsUart0(" (");
        iToA(pid);
        putsUart0(")\n");
        tcb[taskTokill].sp = tcb[taskTokill].spInit;
        int8_t mutexIndex = tcb[taskTokill].mutex;
        int8_t semIndex = tcb[taskTokill].semaphore;
        //unlock mutex and remove from queue
        if (mutexIndex != -1)
        {
            if (tcb[taskTokill].state == STATE_BLOCKED_MUTEX)
            {
                for (i = 0; i <= mutexes[mutexIndex].queueSize; i++)
                {
                    if (mutexes[mutexIndex].processQueue[i] == taskTokill)
                    {
                        if (i == MAX_MUTEX_QUEUE_SIZE)
                        {
                            mutexes[mutexIndex].processQueue[i] = 0;
                        }
                        else
                        {
                            for (;i < mutexes[mutexIndex].queueSize; i++)
                            {
                                mutexes[mutexIndex].processQueue[i] = mutexes[mutexIndex].processQueue[i+1];
                            }

                        }
                        mutexes[mutexIndex].queueSize--;
                        break;
                    }
                }
            }
            else
            {
                mutexes[mutexIndex].lock = false;
                //if there is a queue then ready next task, and increment queue
                if (mutexes[mutexIndex].queueSize > 0)
                {
                    mutexes[mutexIndex].lock = true;
                    mutexes[mutexIndex].lockedBy = mutexes[mutexIndex].processQueue[0];
                    tcb[mutexes[mutexIndex].processQueue[0]].state = STATE_READY;
                    for (i = 0; i < mutexes[mutexIndex].queueSize; i++)
                    {
                        mutexes[mutexIndex].processQueue[i] = mutexes[mutexIndex].processQueue[i+1];
                    }
                    mutexes[mutexIndex].queueSize--;
                }
            }
            tcb[taskTokill].mutex = -1;
        }

        if (semIndex != -1)
        {
            if (tcb[taskTokill].state == STATE_BLOCKED_SEMAPHORE)
            {
                for (i = 0; i <= MAX_SEMAPHORE_QUEUE_SIZE; i++)
                {
                    if (semaphores[semIndex].processQueue[i] == taskTokill)
                    {
                        if (i == semaphores[semIndex].queueSize)
                        {
                            semaphores[semIndex].processQueue[i] = 0;
                        }
                        else
                        {
                            for (;i < semaphores[semIndex].queueSize; i++)
                            {
                                semaphores[semIndex].processQueue[i] = semaphores[semIndex].processQueue[i+1];
                            }

                        }
                        semaphores[semIndex].queueSize--;
                        break;
                    }
                }
            }
            else
            {
                semaphores[semIndex].count++;
                if (semaphores[semIndex].queueSize > 0)
                {
                    semaphores[semIndex].count--;
                    tcb[semaphores[semIndex].processQueue[0]].state = STATE_READY;
                    tcb[semaphores[semIndex].processQueue[0]].semaphore = semIndex;

                    for (i = 0; i < semaphores[semIndex].queueSize; i++)
                    {
                        semaphores[semIndex].processQueue[i] = semaphores[semIndex].processQueue[i+1];
                    }
                    semaphores[semIndex].queueSize--;
                }
            }
            tcb[taskTokill].semaphore = -1;
        }
        tcb[taskTokill].state = STATE_STOPPED;
        NVIC_INT_CTRL_R |= NVIC_INT_CTRL_PEND_SV;
    }
    else
    {
        putsUart0("PID not found\n");
    }
}

void restartThreadHelper(uint32_t pid)
{
    uint8_t i = 0;
    bool found = false;
    for (i = 0; i < taskCount; i++)
    {
        if ((uint32_t)tcb[i].pid == pid)
        {
            found = true;
            break;
        }
    }
    if (found)
    {
        uint8_t taskToRestart = i;
        if (tcb[taskToRestart].state == STATE_STOPPED)
        {
            putsUart0("Restarting ");
            putsUart0((char*)tcb[taskToRestart].name);
            putsUart0("\n");
            tcb[taskToRestart].state = STATE_UNRUN;
            tcb[taskToRestart].sp = tcb[taskToRestart].spInit;
        }
        else
        {
            putsUart0("Task Already Running\n");
        }
    }
    else
    {
        putsUart0("PID not found\n");
    }
}

// REQUIRED: modify this function to add support for the service call
// REQUIRED: in preemptive code, add code to handle synchronization primitives
void svCallIsr(void)
{
    uint32_t *psp = (uint32_t*)getPSP();
    uint32_t r0 = (uint32_t)*getPSP();
    uint32_t *pc = (uint32_t*)*(getPSP() + 6);

    uint32_t svcValueNPtr = (uint32_t)pc-2; //& 0xFFFF;
    uint32_t *svcValuePtr = (uint32_t*)svcValueNPtr;
    uint32_t svcValue = *svcValuePtr & 0xFF;
    uint8_t i = 0;

    switch (svcValue){
    case YIELD:
    {
        NVIC_INT_CTRL_R |= NVIC_INT_CTRL_PEND_SV;
        break;
    }
    case SLEEP:
    {
        uint32_t ticks = r0;
        tcb[taskCurrent].state = STATE_DELAYED;
        tcb[taskCurrent].ticks = ticks;
        NVIC_INT_CTRL_R |= NVIC_INT_CTRL_PEND_SV;
        break;
    }
    case MUTEX_LOCK:
    {
        uint8_t mutexIndex = (uint8_t)r0;
        if (mutexes[mutexIndex].lock == false)
        {
            mutexes[mutexIndex].lock = true;
            mutexes[mutexIndex].lockedBy = taskCurrent;
            tcb[taskCurrent].mutex = mutexIndex;
        }
        else
        {
            if (mutexes[mutexIndex].queueSize <= MAX_MUTEX_QUEUE_SIZE)
            {
                mutexes[mutexIndex].processQueue[mutexes[mutexIndex].queueSize] = taskCurrent;
                mutexes[mutexIndex].queueSize++;
                tcb[taskCurrent].state = STATE_BLOCKED_MUTEX;
                tcb[taskCurrent].mutex = mutexIndex;
            }

            NVIC_INT_CTRL_R |= NVIC_INT_CTRL_PEND_SV;
        }
        break;
    }
    case MUTEX_UNLOCK:
    {
        uint8_t mutexIndex = (uint8_t)r0;

        if (mutexes[mutexIndex].lock == true && mutexes[mutexIndex].lockedBy == taskCurrent)
        {
            // unlock task
            mutexes[mutexIndex].lock = false;
            tcb[taskCurrent].mutex = -1;
            //if there is a queue then ready next task, and increment queue
            if (mutexes[mutexIndex].queueSize > 0)
            {
                mutexes[mutexIndex].lock = true;
                mutexes[mutexIndex].lockedBy = mutexes[mutexIndex].processQueue[0];
                tcb[mutexes[mutexIndex].processQueue[0]].state = STATE_READY;
                for (i = 0; i < mutexes[mutexIndex].queueSize; i++)
                {
                    mutexes[mutexIndex].processQueue[i] = mutexes[mutexIndex].processQueue[i+1];
                }
                mutexes[mutexIndex].queueSize--;
            }
        }
        else
        {
            putsUart0("\n***MUTEX WAS NOT LOCKED BY YOU!***\n");
            putsUart0("\n\t***SHUTTING DOWN TASK and SWITCHING TO NEXT TASK!***\n");
            stopThreadHelper((uint32_t)tcb[taskCurrent].pid);
        }
        break;
    }
    case SEMAPHORE_WAIT:
    {
        uint8_t semaphoreIndex = (uint8_t)r0;
        if (semaphores[semaphoreIndex].count > 0)
        {
            semaphores[semaphoreIndex].count--;
            tcb[taskCurrent].semaphore = semaphoreIndex;
        }
        else
        {
            if (semaphores[semaphoreIndex].queueSize <= MAX_SEMAPHORE_QUEUE_SIZE)
            {
                semaphores[semaphoreIndex].processQueue[semaphores[semaphoreIndex].queueSize] = taskCurrent;
                semaphores[semaphoreIndex].queueSize++;
                tcb[taskCurrent].semaphore = semaphoreIndex;
                tcb[taskCurrent].state = STATE_BLOCKED_SEMAPHORE;
            }
            NVIC_INT_CTRL_R |= NVIC_INT_CTRL_PEND_SV;
        }
        break;
    }
    case SEMAPHORE_POST:
    {
        uint8_t semaphoreIndex = (uint8_t)r0;
        semaphores[semaphoreIndex].count++;
        tcb[taskCurrent].semaphore = -1;
        if (semaphores[semaphoreIndex].queueSize > 0)
        {
            semaphores[semaphoreIndex].count--;
            tcb[semaphores[semaphoreIndex].processQueue[0]].state = STATE_READY;
            tcb[semaphores[semaphoreIndex].processQueue[0]].semaphore = semaphoreIndex;

            for (i = 0; i < semaphores[semaphoreIndex].queueSize; i++)
            {
                semaphores[semaphoreIndex].processQueue[i] = semaphores[semaphoreIndex].processQueue[i+1];
            }
            semaphores[semaphoreIndex].queueSize--;
        }
        break;
    }
    case SCHEDULER_TYPE:
    {
        priorityScheduler = (bool)r0;
        break;
    }
    case GET_PID:
    {
        char *processName = (char*)r0;
        uint8_t i = 0;
        *psp = -1;
        for (i = 0; i < taskCount; i++)
        {
            if (strCmp(processName, tcb[i].name))
            {
                *psp = tcb[i].pid;   //store pid at R0
                break;
            }
        }
        break;
    }
    case GET_MUTEX_INFO:
    {
        //TODO: Check if pointer is valid

        MUTEX_INFO *mutexInfo = (MUTEX_INFO*)r0;
        uint8_t mutexNum = (uint8_t)*(psp+1);
        stringCopy(mutexInfo->name,mutexes[mutexNum].name);
        mutexInfo->lockStatus = mutexes[mutexNum].lock;
        uint8_t i = 0;
        if (mutexInfo->lockStatus)
        {
            stringCopy(mutexInfo->lockedBy,tcb[mutexes[mutexNum].lockedBy].name);
            mutexInfo->queueSize = mutexes[mutexNum].queueSize;
            for (i = 0; i < mutexes[mutexNum].queueSize; i++)
            {
                stringCopy(mutexInfo->processInQueue[i], tcb[mutexes[mutexNum].processQueue[i]].name);
            }
        }
        break;
    }
    case GET_SEMAPHORE_INFO:
    {
        //TODO: Check if pointer is valid
        SEM_INFO *semInfo = (SEM_INFO*)r0;
        uint8_t semNum = (uint8_t)*(psp+1);

        stringCopy(semInfo->name,semaphores[semNum].name);
        semInfo->count = semaphores[semNum].count;
        uint8_t i = 0;
        if (semInfo->count == 0)
        {
            semInfo->queueSize = semaphores[semNum].queueSize;
            for (i = 0; i < semaphores[semNum].queueSize; i++)
            {
                stringCopy(semInfo->processInQueue[i], tcb[semaphores[semNum].processQueue[i]].name);
            }
        }
        break;
    }
    case STOP_THREAD:
    {
        uint32_t pid = (uint32_t)r0;
        stopThreadHelper(pid);
        break;
    }
    case RESTART_THREAD:
    {
        uint32_t pid = (uint32_t)r0;
        restartThreadHelper(pid);

        break;
    }
    case PREEMPTION_TOGGLE:
    {
        preemption = (bool)r0;
        break;
    }
    case THREAD_PRIORITY:
    {
        uint32_t pid = (uint32_t)r0;
        uint8_t prio = (uint8_t)*(psp+1);

        uint8_t i = 0;
        for (i = 0; i < taskCount; i++)
        {
            if ((uint32_t)tcb[i].pid == pid)
            {
                tcb[i].priority = prio;
                putsUart0((char*)tcb[i].name);
                putsUart0(" Priority Level set to ");
                iToA(prio);
                putsUart0("\n");
                break;
            }
        }
        break;
    }
    case REBOOT:
    {
        uint8_t i = 0;
        for (i = 0; i < 30; i++)
        {
            putsUart0("\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n");
        }
        NVIC_APINT_R = NVIC_APINT_VECTKEY | NVIC_APINT_SYSRESETREQ;
        break;
    }
    case GET_TASK_INFO:
    {
        TASK_INFO *taskInfo = (TASK_INFO*)r0;
        uint8_t taskNum = (uint8_t)*(psp+1);
        stringCopy(taskInfo->name,tcb[taskNum].name);
        taskInfo->pid = (uint32_t)tcb[taskNum].pid;
        taskInfo->state = tcb[taskNum].state;
        taskInfo->cpuTime = tcb[taskNum].clocks[!ping]; //TODO: FIX ME

        if (taskNum == 0)
        {
            taskInfo->taskCount = taskCount;
            //taskInfo->taskCount = WTIMER1_TAV_R;
        }

        break;

    }
    }
}

__attribute__ ((naked))void pendSvIsr(void)
{
    //enter pendsv, record stop time t2,
    // Delta t = t2 - t1
    //tcb[taskCurrent].clocks += DeltaT;
    tcb[taskCurrent].clocks[ping] += WTIMER1_TAV_R; //- timeCurrent;
    //    WTIMER1_CTL_R &= ~TIMER_CTL_TAEN;
    //    WTIMER1_TAV_R = 0;
    __asm("   MRS R0, PSP");
    __asm("   STMDB R0!, {R4-R11, LR}");   //store register to psp
    __asm("   MSR PSP, R0");


    tcb[taskCurrent].sp = getPSP();
    taskCurrent = rtosScheduler();
    setPSP((uint32_t)tcb[taskCurrent].sp);
    setSramAccessWindow(tcb[taskCurrent].srd);

    if (tcb[taskCurrent].state == STATE_READY)
    {
        WTIMER1_TAV_R = 0;
        popFromPsp();
    }
    else
    {
        tcb[taskCurrent].state = STATE_READY;
        //timeCurrent = WTIMER1_TAV_R;
        WTIMER1_TAV_R = 0;
        // WTIMER1_CTL_R |= TIMER_CTL_TAEN;     //Leave Pendsv record starting time, t1
        unreadyPush(0x81000000, tcb[taskCurrent].pid, 0xFFFFFFFD);
        __asm("   BX R10");
    }
}

